#include "reg51.h"          //包含头文件
#include "1602.h"
#include "gettime.h"

sbit rs=P2^5;    //命令/数据选择
sbit rw=P2^4;    //读写口
sbit  e=P2^3;    //锁存控制

unsigned char alaflag = 1;
//**************************************************************************************************
//延时函数
//**************************************************************************************************
void delay(uint time)         //int型数据为16位,所以最大值为65535            
 {
  uint  i,j;             //定义变量i,j,用于循环语句 
  for(i=0;i<time;i++)    //for循环,循环50*time次
     for(j=0;j<100;j++); //for循环,循环50次
 }
//**************************************************************************************************
//向LCD写一命令
//**************************************************************************************************
void wcode(unsigned char t)
{
  rs=0;           // 写的是命令
  rw=0;           // 写状态
  e=1;            //使能
  P0=t;           //写入命令 
  delay(20);      //等待写入,如果时间太短，会导致液晶无法显示
  e=0;            //数据的锁定
}
//**************************************************************************************************
//向LCD写一数据
//**************************************************************************************************
void wdata(unsigned char t)
{
  rs=1;          // 写的是数据
  rw=0;          // 写状态
  e=1;           //使能
  P0=t;          //写入数据
  delay(20);     //等待写入,如果时间太短，会导致液晶无法显示
  e=0;           //数据的锁定
}
//************************************************************************************
//功能：LCD显示第一行
//************************************************************************************
void xian1()
{
  unsigned char i;

  wcode(0x80);              //设置第一行显示地址
  wdata('2');                
  wdata('0');               //显示20
   for(i=0;i<2;i++)
     {
      wdata(dtime[6][i]);   //显示年        
     }
  wdata('-');               //显示"-"

   for(i=0;i<2;i++)
     {
      wdata(dtime[4][i]);   //显示月   
     }
   wdata('-'); 
 
   for(i=0;i<2;i++)
     {
      wdata(dtime[3][i]);   //显示日 
     }
  wcode(0x8d);              //设置第一行显示地址
  switch(dtime[5][1])       //显示星期
   {
    case 0x31:wdata('M'); wdata('o');wdata('n'); break; 
    case 0x32:wdata('T'); wdata('u');wdata('e'); break; 
    case 0x33:wdata('W'); wdata('e');wdata('d'); break; 
	case 0x34:wdata('T'); wdata('h');wdata('u'); break; 
	case 0x35:wdata('F'); wdata('r');wdata('i'); break; 
	case 0x36:wdata('S'); wdata('a');wdata('t'); break; 
	case 0x37:wdata('S'); wdata('u');wdata('n'); break;  
    default:break;
   }
}
//************************************************************************************
//功能：LCD显示第二行
//************************************************************************************
void xian2()
{
   unsigned char i; 
   wcode(0xc0);                                     //设置第二行显示地址
   wdata('A'); wdata('l');wdata('a');wdata(':');    //显示闹钟标志Ala:    
 switch(alaflag)                                    //显示闹钟开关状态
   {
    case 1:wdata('O'); wdata('n');break;            //显示ON
    case 0:wdata('O'); wdata('f');wdata('f'); break;//显示OFF
    default:break;
   }
    wcode(0xc8);                                   //设置第二行显示地址
      for(i=0;i<2;i++)
       {
        wdata(dtime[2][i]);                        //显示小时
       }
     wdata(':');                                   //显示":"
      for(i=0;i<2;i++)
       {
        wdata(dtime[1][i]);                        //显示分钟
       }
     wdata(':');                                   //显示":"
      for(i=0;i<2;i++)
       {
        wdata(dtime[0][i]);                        //显示秒
       }
}
//**************************************************************************************************
//LCD 初始化
//**************************************************************************************************
void InitLCD()
   {  		 
   wcode(0x01);	  //清屏
   wcode(0x06);   //输入方式控制,增量光标不移位
   wcode(0x0e);   //显示开关控制
   wcode(0x38);   //功能设定:设置16x2显示，5x7显示,8位数据接口     	
   }  
